{"name":"A L","email":"alok.node@gmail.com","phone":"560098 97172","summary":"FULL STACK DEVELOPMENT - Colourwalls (Bangalore)\nResponsibilities taken for developing client side UI development using Vue.js library with Server side rendering architecture and the corresponding server side modules using Node.js and MongoDB\nFULL STACK DEVELOPMENT - Tnine (Delhi)\nResponsibilities taken for developing Server side rendering architecture based Web Application and the corresponding server side modules using Node.js and MongoDB\nFULL STACK DEVELOPMENT - PoleTalks (Ahmedabad)\nResponsibilities taken for developing client side UI development using React.js library with Redux Architecture and the corresponding server side modules using Node.js and MongoDB\nFULL STACK DEVELOPMENT - Adurcup (Noida)\nResponsibilities taken for developing data visualizers in Admin Panel using Angular.js library.\nFULL STACK DEVELOPMENT - Flikster (Hyderabad)\nResponsibilities taken for building client side Angular-2 card components for website.\nTOOLS AND PARADIGMS\nTOOLS\nGitHub, Bower, Atom, Sublime Text, Visual Studio, Google Docs, Google Webmaster Tools\nPARADIGMS\nPair programming, Modular Development, Clean Code, AJAX, Scalable Application, MVC, User experience design, Logic programming, Prototyping, Dependency Injection, Socket programming, Cloud Development, MVVM, MVP, Design Patterns, REST, Web Design, Cross-browser JavaScript,Object-oriented Design (OOD)\nDATABASES\nHTML5 Web Storage, MySQL, MongoDB","projects":"Colourwalls\nDevelopment of web application based on Vue.js with server rendered architecture of Colourwalls along with the native Android application based on MVVM architecture in Kotlin language .\nHere is the link to the website of the project - https://colourwalls.com\nHere is the link to the Android app on Playstore - https://play.google.com/store/apps/details?id=com.colourwalls.cw\nDevelopment of the backend structure of the application based on Node.js and MongoDB.\nInteriocafe\nDevelopment of web application based on Vue.js with server rendered architecture of Interiocafe .\nDevelopment of the backend structure of the application based on Node.js and MongoDB.\nHere is the link to the website of the project - https://interiocafe.com\nCaption Plus\nDevelopment of AI-based image suggestion platform wherein a user can upload an image and get caption suggestions according to it and post it on social-media platform for gaining more influence and popularity.\nThe backend structure of the application is based on Node.js and MongoDB and the client side UI is based on Vue.js library.\nHere is the link to the website of the project - https://captionplus.app\nCrumblyy\nDevelopment of content based AI-Paltform which revolves around the concept of daily life hacks, tips and tricks.\nThe backend structure of the application is based on Node.js and MongoDB.\nHere is the link to the website of the project - https://crumblyy.com\nEDUCAT ION\nB.Tech(Mechanical) - JNTU Hyderabad\nIntermediate - CBSE\nMatriculation - CBSE","interests":"Active in Coding jams and hiring challenges.\nLAN Gaming, Strategy Games, Music.\nDECLARATION\nI confirm that the information provided by me is true to the best of my knowledge and belief.\nPLACE : Bangalore\nDATE:"}